update readmne
